// Урок номер 27 - Задачи с собеседований на понимание основ

'use strict';

//Какое будет выведено значение:
let x = 5; alert( x++ );


//Чему равно такое выражение:
[ ] + false - null + true ?  // "NuN"


//Что выведет этот код:
let y = 1; let x = y = 2; alert(x); // 2


//Чему равна сумма
[ ] + 1 + 2? // "12"


//Что выведет этот код:
alert( "1"[0] )? // 1


//Чему равно
2 && 1 && null && 0 && undefined ? // null; И(&&) запинается на лжи, а (||) всегда запинается на правде


//Есть ли разница между выражениями?
!!( a && b ) и (a && b)? // false


//Что выведет этот код:
alert( null || 2 && 3 || 4 ); ? // 3


//Правда ли что a == b ?
a = [1, 2, 3]; b = [1, 2, 3]; //false


//Что выведет этот код:
alert( +"Infinity" ); // Infinity


//Верно ли сравнение:

"Ёжик" > "яблоко"? //false


//Чему равно

0 || "" || 2 || undefined || true || falsе  // 2
